In [1]:
import pandas as pd 
df = pd.read_csv('spam_ham_dataset.csv')
df

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0
2,3624,ham,"Subject: neon retreat\r\nho ho ho , we ' re ar...",0
3,4685,spam,"Subject: photoshop , windows , office . cheap ...",1
4,2030,ham,Subject: re : indian springs\r\nthis deal is t...,0
...,...,...,...,...
5166,1518,ham,Subject: put the 10 on the ft\r\nthe transport...,0
5167,404,ham,Subject: 3 / 4 / 2000 and following noms\r\nhp...,0
5168,2933,ham,Subject: calpine daily gas nomination\r\n>\r\n...,0
5169,1409,ham,Subject: industrial worksheets for august 2000...,0
5170,4807,spam,Subject: important online banking alert\r\ndea...,1

In [2]:
df=df.drop(['Unnamed: 0','label_num'],axis=1)
df

     label                                               text
0      ham  Subject: enron methanol ; meter # : 988291\r\n...
1      ham  Subject: hpl nom for january 9 , 2001\r\n( see...
2      ham  Subject: neon retreat\r\nho ho ho , we ' re ar...
3     spam  Subject: photoshop , windows , office . cheap ...
4      ham  Subject: re : indian springs\r\nthis deal is t...
...    ...                                                ...
5166   ham  Subject: put the 10 on the ft\r\nthe transport...
5167   ham  Subject: 3 / 4 / 2000 and following noms\r\nhp...
5168   ham  Subject: calpine daily gas nomination\r\n>\r\n...
5169   ham  Subject: industrial worksheets for august 2000...
5170  spam  Subject: important online banking alert\r\ndea...

[5171 rows x 2 columns]

In [3]:
df.groupby('label').describe()

       text
      count unique                                                top freq
label
ham    3672   3531  Subject: calpine daily gas nomination\r\n>\r\n...   20
spam   1499   1462                                      Subject: \r\n   16

In [7]:
df['spam'] = df['label'].apply(lambda x:1 if x=='spam' else 0)
df

     label                                               text  spam
0      ham  Subject: enron methanol ; meter # : 988291\r\n...     0
1      ham  Subject: hpl nom for january 9 , 2001\r\n( see...     0
2      ham  Subject: neon retreat\r\nho ho ho , we ' re ar...     0
3     spam  Subject: photoshop , windows , office . cheap ...     1
4      ham  Subject: re : indian springs\r\nthis deal is t...     0
...    ...                                                ...   ...
5166   ham  Subject: put the 10 on the ft\r\nthe transport...     0
5167   ham  Subject: 3 / 4 / 2000 and following noms\r\nhp...     0
5168   ham  Subject: calpine daily gas nomination\r\n>\r\n...     0
5169   ham  Subject: industrial worksheets for august 2000...     0
5170  spam  Subject: important online banking alert\r\ndea...     1

[5171 rows x 3 columns]

In [28]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(df.text,df.spam,test_size=0.25)

In [29]:
#count  vectorizer technique
from sklearn.feature_extraction.text import CountVectorizer
v = CountVectorizer()
x_train_count = v.fit_transform(x_train.values)
x_train_count

<3878x42311 sparse matrix of type '<class 'numpy.int64'>'
	with 342081 stored elements in Compressed Sparse Row format>

In [30]:
from sklearn.naive_bayes import MultinomialNB
model =MultinomialNB()
model.fit(x_train_count,y_train)

MultinomialNB()

In [31]:
emails=['You have still not claimed the compensation you are due for the accident you had. To start the process please reply YES. To opt out text STOP',
       'hello can we football today in NI inter college']

In [32]:
email_count=v.transform(emails)
model.predict(email_count)

array([1, 1], dtype=int64)

In [33]:
x_test_count=v.transform(x_test)
model.score(x_test_count,y_test)

0.9752513534416086

In [34]:
#pipeline
from sklearn.pipeline import Pipeline
clf = Pipeline([
    ('vectorize',CountVectorizer()),
    ('nb',MultinomialNB())
])

clf.fit(x_train,y_train)
clf.score(x_test,y_test)

0.9752513534416086